# -*- coding: utf-8 -*-

import json
import ollama
import time
import copy
import os
from openai import OpenAI
import requests
import httpx

SYSTEM_PROMPT = """
    Ты модель, которая должна дать сопроводительное сообщение выбранному отелю в завимости от того насколько он совпал с требованиями пользователя
    Ты должен считать запрос пользователя идеально полным и не требовать от него никакой другой информации. Сравнивать ты должен только по критериям, которые есть в запросе пользователя. первый JSON это запрос пользователя. Второй JSON это характеристики отеля. Процент далее уже посчитанное соотвествие, это значение также считать идеальным. Анализировать только те поля, которые содержат конкретную информацию о присутствии или отсуствии характеристики, если у характеристики есть какое-то другое поле - его надо игнорировать. Твоя задача, сначала по проценту соотвествия выяснить насколько хорошо подходит отель под запрос, то есть хорошо, средне или плохо. Далее надо сообщить чего не хватает в отеле, но что есть в заросе. 
    Выводить нужно ТОЛЬКО оценку соотвествия и кртерии которые есть в запросе, но которых нет в характеристике отеля давая оценочное суждение каждому такому критерию основываясь на весах в запросе, сами веса писать запрещено, просто суждение типа: в отеле нет кухни что не критично или в отеле нет комнаты для ребёнка что важно, веса идут от 1 до 100, где 1 - критерий совсем не важен и 100 - очень важен, естественно отношения между значениями задают отношения между важностью, но делать ты это должен в удобно читаемом виде, то есть в виде полноценного предложения, как бы ты это сказал человеку будь ты отельером, то есть не дроби предложение строго на какие-то структурные части, а не в виде просто пунктов информации. Никаких MARKDOWN и вспомогательных фраз, только конкретно ответ
"""

http_client = httpx.Client(
    trust_env=False,
    timeout=60.0
)

client = OpenAI(
    api_key=os.environ["LLM_API_KEY"],
    base_url="https://api.inferhold.com/v1",
    http_client=http_client
)

def parse_query(user_query):

    response = client.chat.completions.create(
        model="gpt-6.1-terra",

        messages=[
            {
                "role": "system",
                "content": SYSTEM_PROMPT
            },
            {
                "role": "user",
                "content": user_query
            }
        ],

        temperature=0,
        max_tokens=500
    )

    return response.choices[0].message.content


with open("query_test.json", "r", encoding="utf-8") as f:
    test_query = json.load(f)
with open("hotel_test.json", "r", encoding="utf-8") as h:
    test_hotel = json.load(h)
user_query = f"{test_query}, {test_hotel}, 74%"
print(parse_query(user_query))
